[
    {
        "post_summary": "{\"title\": \"Sorry na ma, rider lang po talaga\", \"selftext\": \"A humorous post implying that a mother suspects their child of being romantically involved with a frequent Shopee delivery rider, sparking playful reactions from the community.\"}",
        "comments_summary": "{\"title\": \"Community jokes about a potential romance with a Shopee rider\", \"selftext\": \"The comments section is filled with humorous takes on the idea of a Shopee delivery rider becoming a romantic partner, with users playfully exaggerating the situation.\", \"comments\": [\"Introduce the rider to your mother officially.\", \"Prepare for a future where riders become more than just delivery personnel.\", \"Consider writing a Wattpad-style romance story based on the situation.\", \"Users joke about dating or even marrying the delivery rider.\", \"Many share similar family situations where delivery riders are frequently around.\", \"Some mention how their parents also suspect them of knowing delivery personnel too well.\", \"Several comments reference fictional love stories inspired by this scenario.\"]}"
    },
    {
        "post_summary": "{\"title\": \"Ramdam ko yung bigat ng pinagdadaanan ni buyer.\", \"selftext\": \"The post features a humorous venting session by a buyer who reviews a product, with the review seemingly more about their personal experience than the product itself. The review includes complaints and exaggerated expressions, leading to laughter and empathy from the community. The post humorously highlights the frustrations of the buyer, but also makes light of the situation.\"}",
        "comments_summary": "{\"title\": \"Community response to humorous and random product review\", \"selftext\": \"The comments reflect a blend of amusement and empathy toward the buyer\\u2019s exaggerated and random venting. Several commenters share their own relatable experiences, while others focus on the humorous aspect of the review, making light of the situation.\", \"comments\": [\"Users suggest that the review style is more entertaining than typical product reviews.\", \"Some commenters relate to the struggles expressed in the review, offering personal anecdotes.\", \"Many users jokingly praise the effectiveness of the product mentioned in the review, comparing it to other similar products like Vicks or Katinko.\", \"A few suggest submitting the buyer\\u2019s story for a TV segment due to its entertaining nature.\", \"Commenters appreciate the humor in the review and share their own related experiences.\", \"Some offer helpful suggestions regarding alternative products for allergy relief.\", \"Others poke fun at the exaggerated nature of the review and emphasize how it adds personality to the usual reviews.\", \"A few comments include light-hearted jabs at the concept of 'first world problems' and playful criticisms of the review's style.\"]}"
    },    
    {
        "post_summary": "{\"title\": \"My Filipino themed tree\", \"selftext\": \"I shared my filipino inspired tree to other subs and a couple of redditors have sent me a message asking for a breakdown of my suppliers. Might as well share here because (a) tis the season and (b) it involved lots of shopping from Lazada except for the angel tree topper. Will add the list of suppliers in the comments. Hope this inspires more Filipinos themed Christmas trees next year. Happy Holidays!\"}",
        "comments_summary": "{\"title\": \"My Filipino themed tree\", \"selftext\": \"The post showcases a Filipino-inspired Christmas tree, featuring various handmade decorations sourced from local suppliers. The user shares a list of suppliers for others to check out. The comments are filled with praise, admiration, and light humor. Some users express plans to replicate the tree design next Christmas, while others suggest minor improvements, such as smaller fans. The sentiment is overall positive and celebratory, with some playful jokes and discussions about the tree's design and local culture.\", \"comments\": [\"Users express admiration and plans to replicate the tree next year with some design adjustments.\", \"The list of suppliers is appreciated, and users express interest in exploring more local handicrafts.\", \"Some comments humorously mention the large size of the fans and suggest they could be smaller to allow the tree's finer details to shine.\", \"There are playful jokes about borrowing items and a comment about the fans resembling other cultural symbols.\", \"Sentiment is overwhelmingly positive, with users expressing creativity and a desire to incorporate local Filipino elements into their own decorations.\"]}"
    },
    {
        "post_summary": "{\"title\": \"Can you suggest wireless earphones/earbuds...\", \"selftext\": \"The user is looking for suggestions for wireless earphones/earbuds with a budget of 1k - 2k, specifically for listening to Spotify, Youtube, and Tiktok. The user wants earphones with a battery life of at least 10 hours of continuous usage and prefers noise isolation for commuting. The post mentions frequent earphone usage during the day, and the user is looking to gift themselves for Christmas. The user is also checking suggestions and reviews. Thanks for the help!\"}",
        "comments_summary": "{\"title\": \"Can you suggest wireless earphones/earbuds...\", \"selftext\": \"The comments provide various recommendations for wireless earphones/earbuds, with a mix of brand suggestions and reviews. Some users mention long-lasting battery life and good sound quality. Brands like Soundcore, Edifier, Baseus, and Mpow are frequently recommended. Some users mention options outside the original budget, such as the Galaxy Buds and Jabra Elite 2, while others suggest budget-friendly options like Suntex Lumina and Jeep wireless earphones. Overall, the sentiment is helpful and focused on providing practical options within the given budget.\", \"comments\": [\"Users suggest different brands like Soundcore, Edifier, and Baseus based on battery life and sound quality.\", \"There are discussions about the quality and longevity of the products, with some users sharing personal experiences of usage.\", \"Some users mention that the recommended options might go over budget but still offer excellent value for money.\", \"Other users recommend budget-friendly options with decent sound and battery life.\", \"The sentiment is supportive, with users actively trying to help by sharing their own experiences and insights about wireless earphones/earbuds.\"]}"
    },    
    {
        "post_summary": "{\"title\": \"Iphone 13 or Iphone 15?\", \"selftext\": \"The user is considering purchasing their first iPhone but is unsure about the differences between the iPhone 13 and iPhone 15 in terms of specs. They prefer a phone with a long-lasting battery, although they’ve heard iOS tends to drain battery quickly. The camera quality is also a key factor in their decision. They plan to use the phone as their main device and are seeking advice. Thank you in advance!\"}",
        "comments_summary": "{\"title\": \"Iphone 13 or Iphone 15?\", \"selftext\": \"The comments offer a range of opinions, with many users recommending the iPhone 15 if the budget allows, highlighting the benefits like Type C charging. Others suggest the iPhone 13 is still a good option, especially for those on a budget, with some users noting it has decent battery health after 3 years. Some users mention that the difference in camera quality and battery life between the two models is not significant for everyday use. Sentiment is mixed, but most advice centers on price versus features.\", \"comments\": [\"Users suggest the iPhone 15 if the budget allows, citing improvements like Type C charging.\", \"Some recommend the iPhone 13 for those on a budget, noting the specs are still comparable for most uses.\", \"There are discussions about battery life, with some users mentioning that the iPhone 13 has better battery health and longevity than the iPhone 15.\", \"A few users mention the camera quality of the iPhone 15 as disappointing compared to expectations.\", \"Overall sentiment is helpful, with users offering advice based on personal experience and preferences.\"]}"
    },
    {
        "post_summary": "{\"title\": \"BEST PHONES UNDER 15K\", \"selftext\": \"The user is asking for recommendations on phones under or around 15k, prioritizing camera and photo quality. They are seeking advice on the pros and cons of various models. Thanks in advance for the suggestions!\"}",
        "comments_summary": "{\"title\": \"BEST PHONES UNDER 15K\", \"selftext\": \"The comments offer a variety of phone recommendations in the 15k price range, with an emphasis on camera quality. Popular suggestions include Tecno Camon 30 (5G and 4G models), Infinix GT 20 Pro, and various Redmi models. Users also recommend checking out deals during sales, with mentions of the Samsung A53 and iPhone 11 (with discounts). Some users caution about the user interface of certain brands like Tecno and Infinix, while others suggest second-hand phones like Samsung flagships for better specs. Overall, the sentiment is helpful, with a mix of budget-friendly options and sales advice.\", \"comments\": [\"Tecno Camon 30 is recommended for its good camera performance, though the 5G version lacks an earphone jack.\", \"Infinix GT 20 Pro is suggested for gamers, with a potential discount to bring the price within budget.\", \"The Redmi 13 Pro and 13 5G are mentioned for their high-resolution displays and decent camera quality, but with some cons like bloatware and lowlight performance issues.\", \"Some users suggest considering second-hand Samsung flagship models for better camera and specs, with advice to check battery health and storage.\", \"Sentiment is a mix of helpful suggestions, with users sharing specific brand recommendations and providing advice on sales and second-hand options.\"]}"
    },
    {
        "post_summary": "{\"title\": \"Remember this post?\", \"selftext\": \"OP shares that they are using leftover money from donations to pay it forward by continuing to feed stray cats and dogs. They also mention that they will upload the original video on their profile and offer services like editing and social media management in exchange for commissions.\"}",
        "comments_summary": "{\"title\": \"Remember this post?\", \"selftext\": \"The comments praise OP for their kind actions, offering support and blessings for feeding stray animals. There are some mentions of job opportunities and encouraging words for OP's future success. A few comments provide updates on the video upload and ask for help regarding skin rashes. A few skeptical comments joke about borrowing money and selling NSFW videos, but overall, the sentiment is positive and supportive.\", \"comments\": [\"OP praised for feeding strays, with messages of blessings and support.\", \"Some users share job opportunities and encourage OP’s future success.\", \"A few comments joke about scams or borrowing money, but the majority are positive.\", \"Sentiment is overwhelmingly supportive, with many offering encouragement and sharing good wishes.\"]}"
    },
    {
        "post_summary": "{\"title\": \"Ilo-Ilo to Boracay via car route suggestions\", \"selftext\": \"OP is planning a trip to Boracay from Ilo-ilo with friends in a private vehicle and is asking for the best route suggestions and potential tourist spots to visit along the way.\"}",
        "comments_summary": "{\"title\": \"Ilo-Ilo to Boracay via car route suggestions\", \"selftext\": \"The comments mention that there is only one major route to Boracay, with Jawili Falls suggested as a possible stop, though it's not considered a significant attraction. The sentiment is informative, with minimal additional suggestions offered.\", \"comments\": [\"Comment advises that there is only one main route to Boracay and mentions Jawili Falls as a potential stop.\", \"Sentiment is helpful but somewhat minimal, with no major tourist spots recommended along the route.\"]}"
    },
    {
        "post_summary": "{\"title\": \"Remote working - Boracay\", \"selftext\": \"OP is traveling from the UK to the Philippines and plans to visit Boracay with family for a week. They need to work remotely in the evenings and are asking for suggestions on good places to work, whether hotels like Sheraton or Hannon have strong Wi-Fi for video calls, and if there are any 'remote working offices' available in Boracay.\"}",
        "comments_summary": "{\"title\": \"Remote working - Boracay\", \"selftext\": \"The comments provide a variety of suggestions for remote working in Boracay, with advice that hotels generally offer decent Wi-Fi. Recommended locations include Diamond Hotel with strong Wi-Fi, cafes like Starbucks, and the option of using a local eSIM or mobile hotspot as a backup. Users also mention that Boracay’s cell signal strength and internet coverage, including 5G in some areas, are reliable for remote work.\", \"comments\": [\"Comment suggests hotels in Boracay generally have decent Wi-Fi.\", \"Recommendations include cafes and Starbucks, but users advise checking for Wi-Fi availability beforehand.\", \"A user highlights Diamond Hotel as a reliable option with strong Wi-Fi (300-500Mbps).\", \"Commenters mention that Wi-Fi in Boracay is dependable for remote work, with a suggestion to get a local eSim as a backup.\", \"Users emphasize that mobile data (5G) can be used as backup in case of Wi-Fi issues.\", \"General sentiment is reassuring that remote work in Boracay is feasible, with reliable internet options in many places.\"]}"
    },
    {
        "post_summary": "{\"title\": \"Is there a cheaper / alternative way to go to Batanes?\", \"selftext\": \"OP has visited Batanes pre-pandemic with Cebu Pacific, but now only PAL flights seem available. They are looking for cheaper or alternative ways to travel to Batanes again once things improve. OP shares their best solo travel experience there and wants to repeat it soon.\"}",
        "comments_summary": "{\"title\": \"Is there a cheaper / alternative way to go to Batanes?\", \"selftext\": \"The comments provide a variety of suggestions for cheaper ways to travel to Batanes. Options include booking PAL flights during sales, using PAL miles for discounted flights, taking buses to nearby cities like Tuguegarao or Laoag and then flying with smaller airlines like Sky Pasada or SkyJet, and even using boat rides from Cagayan to Batanes. Some users also mention cheaper flight options found through agencies or promotions, with prices ranging from 5k-9k. However, they also note that travel to Batanes can be expensive but is worth the cost.\", \"comments\": [\"One commenter booked a PAL flight for 8k round-trip last September, though prices have since increased to around 20k.\", \"A user shares how they used PAL miles for a discounted flight with only a small fee for travel tax.\", \"Some suggest taking a bus to Tuguegarao, then flying with smaller airlines like Sky Pasada, but note these flights don’t operate daily.\", \"Another commenter mentions a cheaper but longer route involving a bus ride to Tuguegarao followed by a Sky Pasada flight.\", \"A user reports a flight via Sky Pasada for ₱17,500 one-way, though there were complaints about the engine noise.\", \"Several users recommend looking for promotions, mentioning a past PAL sale for 5k RT.\", \"Some suggest checking Skyscanner for deals, while another recommends contacting Iraya Travel for cheaper Clark-Basco flights.\", \"One commenter shares an alternative boat route from Cagayan to Batanes for a cheaper option.\", \"Overall, the sentiment suggests that while traveling to Batanes can be expensive, there are various ways to find affordable alternatives or promotions.\"]}"
    }    
]